package com.softserve.homework6;

/*Написати інтерфейс Figure із методом обчислення периметру.
        Написати два класи Rectangle та Square, які наслідують та реалізують інтерфейс Figure.
        В методі main класу Appl створити масив, який складається із двох прямокутників та трьох квадратів.
        В циклі вивести периметри фігур.

        Figure[]  myFigure = { new Rectangle(...),  new Square(...),  new Square(...),  new Rectangle(...), ....};

Тут власне спрацьовує той принцип ООП, коли ми декларуємо масив з батьківськими елементами, але самі об'єкти будуть
нащадками Figure.
Далі ми в циклі обходимо всі елементи, і коли будемо звертатися до методу обчислення периметра,
то цей метод, буде викликатися від об'єкта, а ними будуть по черзі Rectangle та Square.

*/

public interface Figure {
        double calculatePerimeter();
}



